GopalSaraf/Practicals/PSDL/include/proc/pic16hv753.inc
// Register: SLPC1CON0
#define SLPC1CON0 SLPC1CON0
SLPC1CON0                                equ 011Eh
// bitfield definitions
SLPC1CON0_SC1INS_POSN                    equ 0000h
SLPC1CON0_SC1INS_POSITION                equ 0000h
SLPC1CON0_SC1INS_SIZE                    equ 0001h
SLPC1CON0_SC1INS_LENGTH                  equ 0001h
SLPC1CON0_SC1INS_MASK                    equ 0001h
SLPC1CON0_SC1TSS_POSN                    equ 0002h
SLPC1CON0_SC1TSS_POSITION                equ 0002h
SLPC1CON0_SC1TSS_SIZE                    equ 0002h
SLPC1CON0_SC1TSS_LENGTH                  equ 0002h
SLPC1CON0_SC1TSS_MASK                    equ 000Ch
SLPC1CON0_SC1POL_POSN                    equ 0004h
SLPC1CON0_SC1POL_POSITION                equ 0004h
SLPC1CON0_SC1POL_SIZE                    equ 0001h
SLPC1CON0_SC1POL_LENGTH                  equ 0001h
SLPC1CON0_SC1POL_MASK                    equ 0010h
SLPC1CON0_SC1MRPE_POSN                   equ 0005h
SLPC1CON0_SC1MRPE_POSITION               equ 0005h
SLPC1CON0_SC1MRPE_SIZE                   equ 0001h
SLPC1CON0_SC1MRPE_LENGTH                 equ 0001h
SLPC1CON0_SC1MRPE_MASK                   equ 0020h
SLPC1CON0_SC1EN_POSN                     equ 0007h
SLPC1CON0_SC1EN_POSITION                 equ 0007h
SLPC1CON0_SC1EN_SIZE                     equ 0001h
SLPC1CON0_SC1EN_LENGTH                   equ 0001h
SLPC1CON0_SC1EN_MASK                     equ 0080h
SLPC1CON0_SCS1TSS0_POSN                  equ 0002h
SLPC1CON0_SCS1TSS0_POSITION              equ 0002h
SLPC1CON0_SCS1TSS0_SIZE                  equ 0001h
SLPC1CON0_SCS1TSS0_LENGTH                equ 0001h
SLPC1CON0_SCS1TSS0_MASK                  equ 0004h
SLPC1CON0_SCS1TSS1_POSN                  equ 0003h
SLPC1CON0_SCS1TSS1_POSITION              equ 0003h
SLPC1CON0_SCS1TSS1_SIZE                  equ 0001h
SLPC1CON0_SCS1TSS1_LENGTH                equ 0001h
SLPC1CON0_SCS1TSS1_MASK                  equ 0008h

// Register: SLPC1CON1
#define SLPC1CON1 SLPC1CON1
SLPC1CON1                                equ 011Fh
// bitfield definitions
SLPC1CON1_SC1ISET_POSN                   equ 0000h
SLPC1CON1_SC1ISET_POSITION               equ 0000h
SLPC1CON1_SC1ISET_SIZE                   equ 0004h
SLPC1CON1_SC1ISET_LENGTH                 equ 0004h
SLPC1CON1_SC1ISET_MASK                   equ 000Fh
SLPC1CON1_SC1RNG_POSN                    equ 0004h
SLPC1CON1_SC1RNG_POSITION                equ 0004h
SLPC1CON1_SC1RNG_SIZE                    equ 0001h
SLPC1CON1_SC1RNG_LENGTH                  equ 0001h
SLPC1CON1_SC1RNG_MASK                    equ 0010h
SLPC1CON1_SC1ISET0_POSN                  equ 0000h
SLPC1CON1_SC1ISET0_POSITION              equ 0000h
SLPC1CON1_SC1ISET0_SIZE                  equ 0001h
SLPC1CON1_SC1ISET0_LENGTH                equ 0001h
SLPC1CON1_SC1ISET0_MASK                  equ 0001h
SLPC1CON1_SC1ISET1_POSN                  equ 0001h
SLPC1CON1_SC1ISET1_POSITION              equ 0001h
SLPC1CON1_SC1ISET1_SIZE                  equ 0001h
SLPC1CON1_SC1ISET1_LENGTH                equ 0001h
SLPC1CON1_SC1ISET1_MASK                  equ 0002h
SLPC1CON1_SC1ISET2_POSN                  equ 0002h
SLPC1CON1_SC1ISET2_POSITION              equ 0002h
SLPC1CON1_SC1ISET2_SIZE                  equ 0001h
SLPC1CON1_SC1ISET2_LENGTH                equ 0001h
SLPC1CON1_SC1ISET2_MASK                  equ 0004h
SLPC1CON1_SC1ISET3_POSN                  equ 0003h
SLPC1CON1_SC1ISET3_POSITION              equ 0003h
SLPC1CON1_SC1ISET3_SIZE                  equ 0001h
SLPC1CON1_SC1ISET3_LENGTH                equ 0001h
SLPC1CON1_SC1ISET3_MASK                  equ 0008h

// Register: ANSELA
#define ANSELA ANSELA
ANSELA                                   equ 0185h
// bitfield definitions
ANSELA_ANSA0_POSN                        equ 0000h
ANSELA_ANSA0_POSITION                    equ 0000h
ANSELA_ANSA0_SIZE                        equ 0001h
ANSELA_ANSA0_LENGTH                      equ 0001h
ANSELA_ANSA0_MASK                        equ 0001h
ANSELA_ANSA1_POSN                        equ 0001h
ANSELA_ANSA1_POSITION                    equ 0001h
ANSELA_ANSA1_SIZE                        equ 0001h
ANSELA_ANSA1_LENGTH                      equ 0001h
ANSELA_ANSA1_MASK                        equ 0002h
ANSELA_ANSA2_POSN                        equ 0002h
ANSELA_ANSA2_POSITION                    equ 0002h
ANSELA_ANSA2_SIZE                        equ 0001h
ANSELA_ANSA2_LENGTH                      equ 0001h
ANSELA_ANSA2_MASK                        equ 0004h
ANSELA_ANSA4_POSN                        equ 0004h
ANSELA_ANSA4_POSITION                    equ 0004h
ANSELA_ANSA4_SIZE                        equ 0001h
ANSELA_ANSA4_LENGTH                      equ 0001h
ANSELA_ANSA4_MASK                        equ 0010h

// Register: ANSELC
#define ANSELC ANSELC
ANSELC                                   equ 0187h
// bitfield definitions
ANSELC_ANSC0_POSN                        equ 0000h
ANSELC_ANSC0_POSITION                    equ 0000h
ANSELC_ANSC0_SIZE                        equ 0001h
ANSELC_ANSC0_LENGTH                      equ 0001h
ANSELC_ANSC0_MASK                        equ 0001h
ANSELC_ANSC1_POSN                        equ 0001h
ANSELC_ANSC1_POSITION                    equ 0001h
ANSELC_ANSC1_SIZE                        equ 0001h
ANSELC_ANSC1_LENGTH                      equ 0001h
ANSELC_ANSC1_MASK                        equ 0002h
ANSELC_ANSC2_POSN                        equ 0002h
ANSELC_ANSC2_POSITION                    equ 0002h
ANSELC_ANSC2_SIZE                        equ 0001h
ANSELC_ANSC2_LENGTH                      equ 0001h
ANSELC_ANSC2_MASK                        equ 0004h
ANSELC_ANSC3_POSN                        equ 0003h
ANSELC_ANSC3_POSITION                    equ 0003h
ANSELC_ANSC3_SIZE                        equ 0001h
ANSELC_ANSC3_LENGTH                      equ 0001h
ANSELC_ANSC3_MASK                        equ 0008h

// Register: APFCON
#define APFCON APFCON
APFCON                                   equ 0188h
// bitfield definitions
APFCON_T1GSEL_POSN                       equ 0004h
APFCON_T1GSEL_POSITION                   equ 0004h
APFCON_T1GSEL_SIZE                       equ 0001h
APFCON_T1GSEL_LENGTH                     equ 0001h
APFCON_T1GSEL_MASK                       equ 0010h

