GopalSaraf/Practicals/PSDL/include/proc/pic16hv753.inc
// Register: COG1DBF
#define COG1DBF COG1DBF
COG1DBF                                  equ 0197h
// bitfield definitions
COG1DBF_G1DBF_POSN                       equ 0000h
COG1DBF_G1DBF_POSITION                   equ 0000h
COG1DBF_G1DBF_SIZE                       equ 0004h
COG1DBF_G1DBF_LENGTH                     equ 0004h
COG1DBF_G1DBF_MASK                       equ 000Fh
COG1DBF_G1DBF0_POSN                      equ 0000h
COG1DBF_G1DBF0_POSITION                  equ 0000h
COG1DBF_G1DBF0_SIZE                      equ 0001h
COG1DBF_G1DBF0_LENGTH                    equ 0001h
COG1DBF_G1DBF0_MASK                      equ 0001h
COG1DBF_G1DBF1_POSN                      equ 0001h
COG1DBF_G1DBF1_POSITION                  equ 0001h
COG1DBF_G1DBF1_SIZE                      equ 0001h
COG1DBF_G1DBF1_LENGTH                    equ 0001h
COG1DBF_G1DBF1_MASK                      equ 0002h
COG1DBF_G1DBF2_POSN                      equ 0002h
COG1DBF_G1DBF2_POSITION                  equ 0002h
COG1DBF_G1DBF2_SIZE                      equ 0001h
COG1DBF_G1DBF2_LENGTH                    equ 0001h
COG1DBF_G1DBF2_MASK                      equ 0004h
COG1DBF_G1DBF3_POSN                      equ 0003h
COG1DBF_G1DBF3_POSITION                  equ 0003h
COG1DBF_G1DBF3_SIZE                      equ 0001h
COG1DBF_G1DBF3_LENGTH                    equ 0001h
COG1DBF_G1DBF3_MASK                      equ 0008h

// Register: COG1CON0
#define COG1CON0 COG1CON0
COG1CON0                                 equ 0198h
// bitfield definitions
COG1CON0_G1MD_POSN                       equ 0000h
COG1CON0_G1MD_POSITION                   equ 0000h
COG1CON0_G1MD_SIZE                       equ 0001h
COG1CON0_G1MD_LENGTH                     equ 0001h
COG1CON0_G1MD_MASK                       equ 0001h
COG1CON0_G1LD_POSN                       equ 0002h
COG1CON0_G1LD_POSITION                   equ 0002h
COG1CON0_G1LD_SIZE                       equ 0001h
COG1CON0_G1LD_LENGTH                     equ 0001h
COG1CON0_G1LD_MASK                       equ 0004h
COG1CON0_G1POL0_POSN                     equ 0003h
COG1CON0_G1POL0_POSITION                 equ 0003h
COG1CON0_G1POL0_SIZE                     equ 0001h
COG1CON0_G1POL0_LENGTH                   equ 0001h
COG1CON0_G1POL0_MASK                     equ 0008h
COG1CON0_G1POL1_POSN                     equ 0004h
COG1CON0_G1POL1_POSITION                 equ 0004h
COG1CON0_G1POL1_SIZE                     equ 0001h
COG1CON0_G1POL1_LENGTH                   equ 0001h
COG1CON0_G1POL1_MASK                     equ 0010h
COG1CON0_G1OE0_POSN                      equ 0005h
COG1CON0_G1OE0_POSITION                  equ 0005h
COG1CON0_G1OE0_SIZE                      equ 0001h
COG1CON0_G1OE0_LENGTH                    equ 0001h
COG1CON0_G1OE0_MASK                      equ 0020h
COG1CON0_G1OE1_POSN                      equ 0006h
COG1CON0_G1OE1_POSITION                  equ 0006h
COG1CON0_G1OE1_SIZE                      equ 0001h
COG1CON0_G1OE1_LENGTH                    equ 0001h
COG1CON0_G1OE1_MASK                      equ 0040h
COG1CON0_G1EN_POSN                       equ 0007h
COG1CON0_G1EN_POSITION                   equ 0007h
COG1CON0_G1EN_SIZE                       equ 0001h
COG1CON0_G1EN_LENGTH                     equ 0001h
COG1CON0_G1EN_MASK                       equ 0080h

// Register: COG1CON1
#define COG1CON1 COG1CON1
COG1CON1                                 equ 0199h
// bitfield definitions
COG1CON1_G1CS_POSN                       equ 0000h
COG1CON1_G1CS_POSITION                   equ 0000h
COG1CON1_G1CS_SIZE                       equ 0002h
COG1CON1_G1CS_LENGTH                     equ 0002h
COG1CON1_G1CS_MASK                       equ 0003h
COG1CON1_G1FDBTS_POSN                    equ 0006h
COG1CON1_G1FDBTS_POSITION                equ 0006h
COG1CON1_G1FDBTS_SIZE                    equ 0001h
COG1CON1_G1FDBTS_LENGTH                  equ 0001h
COG1CON1_G1FDBTS_MASK                    equ 0040h
COG1CON1_G1RDBTS_POSN                    equ 0007h
COG1CON1_G1RDBTS_POSITION                equ 0007h
COG1CON1_G1RDBTS_SIZE                    equ 0001h
COG1CON1_G1RDBTS_LENGTH                  equ 0001h
COG1CON1_G1RDBTS_MASK                    equ 0080h
COG1CON1_G1CS0_POSN                      equ 0000h
COG1CON1_G1CS0_POSITION                  equ 0000h
COG1CON1_G1CS0_SIZE                      equ 0001h
COG1CON1_G1CS0_LENGTH                    equ 0001h
COG1CON1_G1CS0_MASK                      equ 0001h
COG1CON1_G1CS1_POSN                      equ 0001h
COG1CON1_G1CS1_POSITION                  equ 0001h
COG1CON1_G1CS1_SIZE                      equ 0001h
COG1CON1_G1CS1_LENGTH                    equ 0001h
COG1CON1_G1CS1_MASK                      equ 0002h

// Register: COG1RIS
#define COG1RIS COG1RIS
COG1RIS                                  equ 019Ah
// bitfield definitions
COG1RIS_G1RIC1_POSN                      equ 0000h
COG1RIS_G1RIC1_POSITION                  equ 0000h
COG1RIS_G1RIC1_SIZE                      equ 0001h
COG1RIS_G1RIC1_LENGTH                    equ 0001h
COG1RIS_G1RIC1_MASK                      equ 0001h
COG1RIS_G1RIC2_POSN                      equ 0001h
COG1RIS_G1RIC2_POSITION                  equ 0001h
COG1RIS_G1RIC2_SIZE                      equ 0001h
COG1RIS_G1RIC2_LENGTH                    equ 0001h
COG1RIS_G1RIC2_MASK                      equ 0002h
COG1RIS_C1RICCP1_POSN                    equ 0002h
COG1RIS_C1RICCP1_POSITION                equ 0002h
COG1RIS_C1RICCP1_SIZE                    equ 0001h
COG1RIS_C1RICCP1_LENGTH                  equ 0001h
COG1RIS_C1RICCP1_MASK                    equ 0004h
COG1RIS_G1RIFLT_POSN                     equ 0003h
COG1RIS_G1RIFLT_POSITION                 equ 0003h
COG1RIS_G1RIFLT_SIZE                     equ 0001h
COG1RIS_G1RIFLT_LENGTH                   equ 0001h
COG1RIS_G1RIFLT_MASK                     equ 0008h
COG1RIS_G1RIT2M_POSN                     equ 0004h
COG1RIS_G1RIT2M_POSITION                 equ 0004h
COG1RIS_G1RIT2M_SIZE                     equ 0001h
COG1RIS_G1RIT2M_LENGTH                   equ 0001h
COG1RIS_G1RIT2M_MASK                     equ 0010h
COG1RIS_G1R1HLT1_POSN                    equ 0005h
COG1RIS_G1R1HLT1_POSITION                equ 0005h
COG1RIS_G1R1HLT1_SIZE                    equ 0001h
COG1RIS_G1R1HLT1_LENGTH                  equ 0001h
COG1RIS_G1R1HLT1_MASK                    equ 0020h
COG1RIS_G1RIHLT2_POSN                    equ 0006h
COG1RIS_G1RIHLT2_POSITION                equ 0006h
COG1RIS_G1RIHLT2_SIZE                    equ 0001h
COG1RIS_G1RIHLT2_LENGTH                  equ 0001h
COG1RIS_G1RIHLT2_MASK                    equ 0040h

// Register: COG1RSIM
#define COG1RSIM COG1RSIM
COG1RSIM                                 equ 019Bh
// bitfield definitions
COG1RSIM_G1RMC1_POSN                     equ 0000h
COG1RSIM_G1RMC1_POSITION                 equ 0000h
COG1RSIM_G1RMC1_SIZE                     equ 0001h
COG1RSIM_G1RMC1_LENGTH                   equ 0001h
COG1RSIM_G1RMC1_MASK                     equ 0001h
COG1RSIM_G1RMC2_POSN                     equ 0001h
COG1RSIM_G1RMC2_POSITION                 equ 0001h
COG1RSIM_G1RMC2_SIZE                     equ 0001h
COG1RSIM_G1RMC2_LENGTH                   equ 0001h
COG1RSIM_G1RMC2_MASK                     equ 0002h
COG1RSIM_G1RMCCP1_POSN                   equ 0002h
COG1RSIM_G1RMCCP1_POSITION               equ 0002h
COG1RSIM_G1RMCCP1_SIZE                   equ 0001h
COG1RSIM_G1RMCCP1_LENGTH                 equ 0001h
COG1RSIM_G1RMCCP1_MASK                   equ 0004h
COG1RSIM_G1RMFLT_POSN                    equ 0003h
COG1RSIM_G1RMFLT_POSITION                equ 0003h
COG1RSIM_G1RMFLT_SIZE                    equ 0001h
COG1RSIM_G1RMFLT_LENGTH                  equ 0001h
COG1RSIM_G1RMFLT_MASK                    equ 0008h
COG1RSIM_G1RTM2M_POSN                    equ 0004h
COG1RSIM_G1RTM2M_POSITION                equ 0004h
COG1RSIM_G1RTM2M_SIZE                    equ 0001h
COG1RSIM_G1RTM2M_LENGTH                  equ 0001h
COG1RSIM_G1RTM2M_MASK                    equ 0010h
COG1RSIM_G1RMHLT1_POSN                   equ 0005h
COG1RSIM_G1RMHLT1_POSITION               equ 0005h
COG1RSIM_G1RMHLT1_SIZE                   equ 0001h
COG1RSIM_G1RMHLT1_LENGTH                 equ 0001h
COG1RSIM_G1RMHLT1_MASK                   equ 0020h
COG1RSIM_G1RMHLT2_POSN                   equ 0006h
COG1RSIM_G1RMHLT2_POSITION               equ 0006h
COG1RSIM_G1RMHLT2_SIZE                   equ 0001h
COG1RSIM_G1RMHLT2_LENGTH                 equ 0001h
COG1RSIM_G1RMHLT2_MASK                   equ 0040h

// Register: COG1FIS
#define COG1FIS COG1FIS
COG1FIS                                  equ 019Ch
// bitfield definitions
COG1FIS_G1FIC1_POSN                      equ 0000h
COG1FIS_G1FIC1_POSITION                  equ 0000h
COG1FIS_G1FIC1_SIZE                      equ 0001h
COG1FIS_G1FIC1_LENGTH                    equ 0001h
COG1FIS_G1FIC1_MASK                      equ 0001h
COG1FIS_G1FIC2_POSN                      equ 0001h
COG1FIS_G1FIC2_POSITION                  equ 0001h
COG1FIS_G1FIC2_SIZE                      equ 0001h
COG1FIS_G1FIC2_LENGTH                    equ 0001h
COG1FIS_G1FIC2_MASK                      equ 0002h
COG1FIS_G1FICCP1_POSN                    equ 0002h
COG1FIS_G1FICCP1_POSITION                equ 0002h
COG1FIS_G1FICCP1_SIZE                    equ 0001h
COG1FIS_G1FICCP1_LENGTH                  equ 0001h
COG1FIS_G1FICCP1_MASK                    equ 0004h
COG1FIS_G1FIFLT_POSN                     equ 0003h
COG1FIS_G1FIFLT_POSITION                 equ 0003h
COG1FIS_G1FIFLT_SIZE                     equ 0001h
COG1FIS_G1FIFLT_LENGTH                   equ 0001h
COG1FIS_G1FIFLT_MASK                     equ 0008h
COG1FIS_G1FIT2M_POSN                     equ 0004h
COG1FIS_G1FIT2M_POSITION                 equ 0004h
COG1FIS_G1FIT2M_SIZE                     equ 0001h
COG1FIS_G1FIT2M_LENGTH                   equ 0001h
COG1FIS_G1FIT2M_MASK                     equ 0010h
COG1FIS_G1FIHLT1_POSN                    equ 0005h
COG1FIS_G1FIHLT1_POSITION                equ 0005h
COG1FIS_G1FIHLT1_SIZE                    equ 0001h
COG1FIS_G1FIHLT1_LENGTH                  equ 0001h
COG1FIS_G1FIHLT1_MASK                    equ 0020h
COG1FIS_G1FIHLT2_POSN                    equ 0006h
COG1FIS_G1FIHLT2_POSITION                equ 0006h
COG1FIS_G1FIHLT2_SIZE                    equ 0001h
COG1FIS_G1FIHLT2_LENGTH                  equ 0001h
COG1FIS_G1FIHLT2_MASK                    equ 0040h

// Register: COG1FSIM
#define COG1FSIM COG1FSIM
COG1FSIM                                 equ 019Dh
// bitfield definitions
COG1FSIM_G1FMC1_POSN                     equ 0000h
COG1FSIM_G1FMC1_POSITION                 equ 0000h
COG1FSIM_G1FMC1_SIZE                     equ 0001h
COG1FSIM_G1FMC1_LENGTH                   equ 0001h
COG1FSIM_G1FMC1_MASK                     equ 0001h
COG1FSIM_G1FMC2_POSN                     equ 0001h
COG1FSIM_G1FMC2_POSITION                 equ 0001h
COG1FSIM_G1FMC2_SIZE                     equ 0001h
COG1FSIM_G1FMC2_LENGTH                   equ 0001h
COG1FSIM_G1FMC2_MASK                     equ 0002h
COG1FSIM_G1FMCCP1_POSN                   equ 0002h
COG1FSIM_G1FMCCP1_POSITION               equ 0002h
COG1FSIM_G1FMCCP1_SIZE                   equ 0001h
COG1FSIM_G1FMCCP1_LENGTH                 equ 0001h
COG1FSIM_G1FMCCP1_MASK                   equ 0004h
COG1FSIM_G1FMFLT_POSN                    equ 0003h
COG1FSIM_G1FMFLT_POSITION                equ 0003h
COG1FSIM_G1FMFLT_SIZE                    equ 0001h
COG1FSIM_G1FMFLT_LENGTH                  equ 0001h
COG1FSIM_G1FMFLT_MASK                    equ 0008h
COG1FSIM_G1FMT2M_POSN                    equ 0004h
COG1FSIM_G1FMT2M_POSITION                equ 0004h
COG1FSIM_G1FMT2M_SIZE                    equ 0001h
COG1FSIM_G1FMT2M_LENGTH                  equ 0001h
COG1FSIM_G1FMT2M_MASK                    equ 0010h
COG1FSIM_G1FMHLT1_POSN                   equ 0005h
COG1FSIM_G1FMHLT1_POSITION               equ 0005h
COG1FSIM_G1FMHLT1_SIZE                   equ 0001h
COG1FSIM_G1FMHLT1_LENGTH                 equ 0001h
COG1FSIM_G1FMHLT1_MASK                   equ 0020h
COG1FSIM_G1FMHLT2_POSN                   equ 0006h
COG1FSIM_G1FMHLT2_POSITION               equ 0006h
COG1FSIM_G1FMHLT2_SIZE                   equ 0001h
COG1FSIM_G1FMHLT2_LENGTH                 equ 0001h
COG1FSIM_G1FMHLT2_MASK                   equ 0040h

